# encoding: UTF-8
$character_hash = {

	"ક" 		=> ["C"],
	"ખ" 	=> ["C"],
	"ગ" 	=> ["C"],
	"ઘ" 	=> ["C"],
	"ઙ" 	=> ["C"],
	"ચ" 	=> ["C"],
	"છ" 	=> ["C"],
	"જ" 	=> ["C"],
	"ઝ" 	=> ["C"],
	"ઞ" 	=> ["C"],
	"ટ" 		=> ["C"],
	"ઠ" 	=> ["C"],
	"ડ" 	=> ["C"],
	"ઢ" 		=> ["C"],
	"ણ" 	=> ["C"],
	"ત" 	=> ["C"],
	"થ" 	=> ["C"],
	"દ" 		=> ["C"],
	"ધ" 	=> ["C"],
	"ન" 	=> ["C"],
	"પ" 	=> ["C"],
	"ફ" 		=> ["C"],
	"બ" 	=> ["C"],
	"ભ" 	=> ["C"],
	"મ" 	=> ["C"],
	"ય" 	=> ["C"],
	"ર" 		=> ["C"],
	"લ" 	=> ["C"],
	"વ" 	=> ["C"],
	"શ" 	=> ["C"],
	"ષ" 	=> ["C"],
	"સ" 	=> ["C"],
	"હ" 		=> ["C"],
	"ળ" 	=> ["C"],


	"ૐ"	=> ["V"],
	"અ" 	=> ["V"],
	"આ" 	=> ["V"],
	"ઇ" 	=> ["V"],
	"ઈ" 	=> ["V"],
	"ઉ" 	=> ["V"],
	"ઊ" 	=> ["V"],
	"એ" 	=> ["V"],
	"ઍ" 	=> ["V"],
	"ઐ" 	=> ["V"],
	"ઓ" 	=> ["V"],
	"ઑ" 	=> ["V"],
	"ઔ" 	=> ["V"],
	"ઋ" 	=> ["V"],
	"ૠ" 	=> ["V"],
 
	"ા" 	=> ["M"],
	"િ" 	=> ["M"],
	"ી" 	=> ["M"],
	"ુ" 	=> ["M"],
	"ૂ" 	=> ["M"],
	"ે" 	=> ["M"],
	"ૅ" 	=> ["M"],
	"ૈ" 	=> ["M"],
	"ો" 	=> ["M"],
	"ૉ" 	=> ["M"],
	"ૌ" 	=> ["M"],
	"ૃ"		=> ["M"],
	"ૄ"		=> ["M"],
	"્"		=> ["M"], 
	"ઁ"		=> ["M"],
	"ં"		=> ["M"],
	"ઃ"	=> ["M"],
	"઼"		=> ["M"],
	"ઽ"		=> ["M"],

}


def is_vowel(char)
	$character_hash[char].include?("V")
end

def is_consonant(char)
	$character_hash[char].include?("C")
end

def is_matra(char)
	$character_hash[char].include?("M")
end

def is_non_matra(char)
	$character_hash[char].include?("C") or $character_hash[char].include?("V")
end